#-------------------------------------------------------------------------------
# Name:        for
# Purpose:
#
# Author:      chenw_000
#
# Created:     21/03/2020
# Copyright:   (c) chenw_000 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------

for x in "ABC":        #把“A”传给“x”
    for y in "123":   #把“1”传给“y”
        print(x+y)   #执行打印输出语句

#先进入外部循环，把“A”传给“x”，然后进入到内部循环，把“1”传给“y”，
#接着执行打印输出语句，输出A1,
#再回到内部for语句，把“2”传给“y”,再打印输出语句，输出A2,
#直到内部循环完毕，才回到外部，接着把“B”传给“x”
#循环次数 = 外循环次数 * 内循环次数